---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PointCloudFilter Properties
PointCloudFilter Class See Also Send Feedback
---

The PointCloudFilter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PointCloudFilter Class

Autodesk.Revit.DB.PointClouds Namespace